{
  "run_id": "RUN_1770651423625",
  "chain_id": 31337,
  "created_at": "2026-02-09T15:38:12.772Z",
  "head_block_start": 0,
  "head_block_end": 1272,
  "total_tx_requested": 1000,
  "user_count": 50,
  "shard_size": 5000,
  "checkpoint_every": 500,
  "snapshot_user_cap": 120,
  "tx_exported_success": 1004,
  "failures_count": 1,
  "notes": {
    "traces": "best-effort via debug_traceTransaction(callTracer); may be missing if node doesn't support; used to extract trace_edges",
    "state_diff": "best-effort via debug_traceTransaction(prestateTracer); Anvil limitation: only pre-state available (mode='prestate_only'). balance_after and storage_after are null. Balances normalized from hex to decimal strings.",
    "approvals": "ERC20 Approval events decoded from receipt logs; enables allowance abuse detection",
    "allowance_edges": "approval events as directed edges for graph analysis",
    "address_profile": "EXPANDED: now captures ALL tx activity (tx_out_count, tx_in_count, gas_spent_wei, total_gas_used, first_seen_ts, last_seen_ts) in addition to ETH/ERC20 flows. Every participant is now profileable.",
    "contract_calls": "NEW: one row per transaction, extracted with method_id, status, gas costs, and timing. Enables contract interaction pattern detection.",
    "method_stats": "NEW: aggregated statistics per (to_address, method_id) pair. Includes count, success/revert counts, unique callers, and temporal window. Identifies hot methods.",
    "trace_edges": "NEW: call graph edges extracted from callTracer output. Each edge: caller, callee, call_type, value, input_selector, depth. Enables execution flow reconstruction.",
    "revert_reasons": "NEW: best-effort extraction of revert reasons from trace output. reason field may be null if unavailable. Only written for reverted txs.",
    "mempool_pending": "OPTIONAL: best-effort capture of pending txs in local Anvil simulation. NOTE: Mempool is ephemeral and not queryable historically on real nodes. This is simulation-specific; do not expect equivalent data in real incidents.",
    "codes": "eth_getCode for all snapshotted addresses (contracts + bounded EOAs)",
    "token_meta": "ERC20 name/symbol/decimals for token contracts",
    "storage_snapshots": "targeted storage reads for key contract slots (safe, minimal)",
    "abi_export": "ABI files (JSON), runtime bytecode (*.bin), and address mappings in ABI/ directory. Bytecode is runtime (deployedBytecode preferred) for on-chain detection."
  }
}